---
type: EnergyAnalysisDetailModelOptions
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 8
tags: [revit-api, class]
---

# EnergyAnalysisDetailModelOptions

`Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | EnergyAnalysisDetailModelOptions | 2012 | `public EnergyAnalysisDetailModelOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EnergyModelType | 2012 | `public EnergyModelType EnergyModelType { get ; set ; }` |
| Property | ExportMullions | 2012 | `public bool ExportMullions { get ; set ; }` |
| Property | IncludeShadingSurfaces | 2012 | `public bool IncludeShadingSurfaces { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SimplifyCurtainSystems | 2012 | `public bool SimplifyCurtainSystems { get ; set ; }` |
| Property | Tier | 2012 | `public EnergyAnalysisDetailModelTier Tier { get ; set ; }` |